# Profilen1 Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
GroupTypeId..::..Profilen1 Property
GroupTypeId Class See Also
---
"Profile 1"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId Profilen1 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Profilen1 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Profilen1 {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace